# IdeaStatiCa.ConnectionApi.Model.ConConnectionLibrarySearchParameters

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Members** | **List&lt;int&gt;** |  | [optional]
**InPredefinedSet** | **bool** |  | [optional]
**InCompanySet** | **bool** |  | [optional]
**InPersonalSet** | **bool** |  | [optional]
**HasBolts** | **SearchOption** |  | [optional]
**HasWelds** | **SearchOption** |  | [optional]
**HasAnchor** | **SearchOption** |  | [optional]
**HasClipAngles** | **SearchOption** |  | [optional]
**IsMoment** | **SearchOption** |  | [optional]
**IsShear** | **SearchOption** |  | [optional]
**IsTruss** | **SearchOption** |  | [optional]
**IsParametric** | **SearchOption** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)